In [26]:
import pandas as pd
df = pd.read_csv("datapoints.txt")
df.columns

Index(['(width (cm)', ' height (cm)', ' label (0-pichu', ' 1-pikachu))'], dtype='object')

In [27]:
df = df.drop(" 1-pikachu))", axis = 1)

In [28]:
df["Pichu_Pikachu"] = df[" label (0-pichu"]
df

     (width (cm)   height (cm)   label (0-pichu  Pichu_Pikachu
0      21.959384     31.239567                0              0
1      23.635916     36.468215                1              1
2      17.714056     31.441704                0              0
3      21.780200     33.213398                1              1
4      25.206306     36.558816                1              1
..           ...           ...              ...            ...
145    18.990690     32.387963                0              0
146    23.542000     32.475193                0              0
147    19.640603     30.291557                0              0
148    21.989954     33.645903                1              1
149    22.302103     32.732379                0              0

[150 rows x 4 columns]

In [29]:
df = df.drop(" label (0-pichu", axis = 1)

In [30]:
df

     (width (cm)   height (cm)  Pichu_Pikachu
0      21.959384     31.239567              0
1      23.635916     36.468215              1
2      17.714056     31.441704              0
3      21.780200     33.213398              1
4      25.206306     36.558816              1
..           ...           ...            ...
145    18.990690     32.387963              0
146    23.542000     32.475193              0
147    19.640603     30.291557              0
148    21.989954     33.645903              1
149    22.302103     32.732379              0

[150 rows x 3 columns]

In [51]:
df.columns = df.columns.str.replace("(", "").str.replace(")", "").str.replace("_h", "H").str.capitalize()
df

      Width_cm  Height_cm  Pichu_pikachu
0    21.959384  31.239567              0
1    23.635916  36.468215              1
2    17.714056  31.441704              0
3    21.780200  33.213398              1
4    25.206306  36.558816              1
..         ...        ...            ...
145  18.990690  32.387963              0
146  23.542000  32.475193              0
147  19.640603  30.291557              0
148  21.989954  33.645903              1
149  22.302103  32.732379              0

[150 rows x 3 columns]

In [32]:
lt=[]
with open("testpoints.txt") as tf:
    vf = tf.readlines()
    for x in vf:
        lt.append(x)

lt

['Test points:\n',
 '1. (25, 32)\n',
 '2. (24.2, 31.5)\n',
 '3. (22, 34)\n',
 '4. (20.5, 34)\n']

In [33]:
import pandas as pd
test_data = pd.DataFrame(lt)

test_data

                   0
0     Test points:\n
1      1. (25, 32)\n
2  2. (24.2, 31.5)\n
3      3. (22, 34)\n
4    4. (20.5, 34)\n

In [34]:
test_data = test_data.drop(0, axis = 0)

In [35]:
test_data["Width"] = test_data[0].str.split("(").str.get(1).str.split(",").str.get(0)
test_data["Height"] = test_data[0].str.split(")").str.get(0).str.split(",").str.get(1)
test_data

                   0 Width Height
1      1. (25, 32)\n    25     32
2  2. (24.2, 31.5)\n  24.2   31.5
3      3. (22, 34)\n    22     34
4    4. (20.5, 34)\n  20.5     34

In [36]:
test_data

                   0 Width Height
1      1. (25, 32)\n    25     32
2  2. (24.2, 31.5)\n  24.2   31.5
3      3. (22, 34)\n    22     34
4    4. (20.5, 34)\n  20.5     34

In [37]:
import numpy as np
test_data[["Width", "Height"]] = test_data[["Width", "Height"]].astype(float)
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 1 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      object
 1   Width   4 non-null      float64
 2   Height  4 non-null      float64
dtypes: float64(2), object(1)
memory usage: 228.0+ bytes

In [40]:
test_data = test_data.drop(0, axis = 1)
test_data

   Width  Height
1   25.0    32.0
2   24.2    31.5
3   22.0    34.0
4   20.5    34.0

In [53]:
#test_data = test_data.drop(0, axis = 0)
test_data

   Width  Height
1   25.0    32.0
2   24.2    31.5
3   22.0    34.0
4   20.5    34.0

In [ ]:
def pichu(width, height)
    liist = []
    for x, y in zip(df["Width_cm"], df["Height_cm"])
        liist.append(np.sqrt(np.power(x-width, 2)+np.power(y-height, 2)))